
&НаКлиенте
Процедура ДеревоЗапросовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//соберем массив ид уровней
	Закрыть(Элементы.ДеревоЗапросов.ТекущиеДанные.ИдИсточника);
КонецПроцедуры

&НаКлиенте
Функция СформироватьМассивУровнейВозврата(ДанныеСтроки,Массив = Неопределено)
	Если Массив = Неопределено Тогда
		Массив = Новый Массив;
	КонецЕсли;
	Массив.Вставить(0,ДанныеСтроки.ИдИсточника);
	Если ДанныеСтроки.ПолучитьРодителя()<>Неопределено Тогда
		СформироватьМассивУровнейВозврата(ДанныеСтроки.ПолучитьРодителя(),Массив);
	КонецЕсли;
	Возврат Массив;
КонецФункции // СформироватьМассивУровнейВозврата()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДеревоВРодителе = ВладелецФормы.ДеревоЗапросов;
	ЗаполнитьСтрокиДерева(ДеревоВРодителе.ПолучитьЭлементы(),ДеревоЗапросов.ПолучитьЭлементы());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтрокиДерева(ДеревоИсточник,УровеньЗаполнения)
	Для Каждого СтрокаДерева Из ДеревоИсточник Цикл
		НоваяСтрока = УровеньЗаполнения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаДерева);
		НоваяСтрока.ИдИсточника = СтрокаДерева.ПолучитьИдентификатор();
		Если СтрокаДерева.ПолучитьЭлементы().Количество()>0 Тогда
			ЗаполнитьСтрокиДерева(СтрокаДерева.ПолучитьЭлементы(),НоваяСтрока.ПолучитьЭлементы());
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСтрокиДерева()

&НаКлиенте
Процедура ПеренестиНаВерхнийУровень(Команда)
	Закрыть("ВерхнийУровень");
КонецПроцедуры
