
&НаКлиенте
Процедура ВключитьТехнологическийЖурнал(Команда)
	ВключитьТехнологическийЖурналНаСервере(ВладелецФормы.УникальныйИдентификатор);
	ВключитьПолучениеПланаЗапросаПриИзменении(Неопределено);
	ВладелецФормы.ВключеноПолучениеПланаЗапросов = Истина;
КонецПроцедуры

&НаСервере
Функция ВключитьТехнологическийЖурналНаСервере(УИД)
	ЭтоФайловая = Найти(ВРЕГ(СтрокаСоединенияИнформационнойБазы()),"FILE=")>0;
	КаталогНастроек = Новый Файл(КаталогПрограммы()+"conf");
	Если НЕ КаталогНастроек.Существует() Тогда
		СоздатьКаталог(КаталогНастроек.ПолноеИмя);
	КонецЕсли;

	//забэкапим старый файл настроек
	СтарыйФайл = Новый Файл(КаталогНастроек.ПолноеИмя+?(ЭтоЛинукс,"/","\")+"logcfg.xml");
	Если СтарыйФайл.Существует() Тогда
		Если Элементы.ВключитьТехнологическийЖурнал.Заголовок = "Отключить технологический журнал" Тогда 
			Попытка
		     УдалитьФайлы(СтарыйФайл.ПолноеИмя);
			 Элементы.ВключитьТехнологическийЖурнал.Заголовок = "Включить технологический журнал";
 	 		Элементы.НадписьВключениеТЖ.Заголовок = "Технологический журнал отключен";
	 		Элементы.НадписьВключениеТЖ.ЦветТекста = WebЦвета.Красный;
			Элементы.ВключитьПолучениеПланаЗапроса.Доступность = Ложь;
			ВключитьПолучениеПланаЗапроса = Ложь;
			 Возврат Истина;
		 Исключение
			 Сообщить("Не удалось отключить технологический журнал:"+Символы.ПС+ОписаниеОшибки());
			  Возврат ложь;
			 КонецПопытки;
		КонецЕсли;
		КопироватьФайл(СтарыйФайл.ПолноеИмя,СтарыйФайл.Путь+"back-"+Формат(ТекущаяДата(),"ДФ=гггг-ММ-дд")+СтарыйФайл.Имя);
	КонецЕсли;
	Если ЭтоФайловая Тогда
		КонфигурационныйФайл = РеквизитФормыВЗначение("Объект").ПолучитьМакет("КонфигФайловойВерсии");
		ТекстФайла = КонфигурационныйФайл.ПолучитьТекст();
		ТекстФайла = СтрЗаменить(ТекстФайла,"#ПутьКЛогам#",КаталогВременныхФайлов()+"ZaprosnikTemp");
	Иначе
		КонфигурационныйФайл = РеквизитФормыВЗначение("Объект").ПолучитьМакет("КонфигКлиентСервернойВерсии");
		ТекстФайла = КонфигурационныйФайл.ПолучитьТекст();
		ТекстФайла = СтрЗаменить(ТекстФайла,"#ПутьКЛогам#",КаталогВременныхФайлов()+"ZaprosnikTemp");
	КонецЕсли;
	КонфигурационныйФайл.УстановитьТекст(ТекстФайла);
	Попытка
		КонфигурационныйФайл.Записать(КаталогНастроек.ПолноеИмя+?(ЭтоЛинукс,"/","\")+"logcfg.xml");
		Элементы.ВключитьПолучениеПланаЗапроса.Доступность = Истина;
	Исключение
		Сообщить("Не удалось настроить технологический журнал:" + Символы.ПС+ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
		
	ОжиданиеЗавершенияНастройки = Истина;

	Элементы.НадписьВключениеТЖ.Заголовок = "Технологический журнал настроен на работу с запросником.";
	Элементы.НадписьВключениеТЖ.ЦветТекста = WebЦвета.ЗеленыйЛес;
	Элементы.ВключитьТехнологическийЖурнал.Заголовок = "Отключить технологический журнал";

КонецФункции

&НаКлиенте
Процедура ПроверитьНаличиеТЖ()
	ЖурналНастроен = ПроверитьНаСервере(ВладелецФормы.УникальныйИдентификатор);
	Если ЖурналНастроен Тогда
		ОтключитьОбработчикОжидания("ПроверитьНаличиеТЖ");
		ОжиданиеЗавершенияНастройки=Ложь;
		Элементы.НадписьВключениеТЖ.Заголовок = "Технологический журнал настроен"
	КонецЕсли;
КонецПроцедуры // ПроверитьНаличиеТЖ()

&НаСервереБезКонтекста
Функция ПроверитьНаСервере(Уид)
	Возврат Истина;
КонецФункции // ПроверитьНаСервере()


&НаКлиенте
Процедура ВключитьПолучениеПланаЗапросаПриИзменении(Элемент)
	ВладелецФормы.ВключеноПолучениеПланаЗапросов = ВключитьПолучениеПланаЗапроса;
	Если ВключитьПолучениеПланаЗапроса И ВладелецФормы.АдресХранилищаМетаданных = "" Тогда
		ВладелецФормы.АдресХранилищаМетаданных = ПоместитьМетаданныеВХранилище(ВладелецФормы.УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоместитьМетаданныеВХранилище(Гуид)
	ТЗ = ПолучитьСтруктуруХраненияБазыДанных(,Истина);
	Возврат ПоместитьВоВременноеХранилище(ТЗ,Гуид);

КонецФункции // ПоместитьМетаданныеВХранилище()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВключитьПолучениеПланаЗапроса = ВладелецФормы.ВключеноПолучениеПланаЗапросов;
	Если Элементы.ВключитьТехнологическийЖурнал.Заголовок = "Включить технологический журнал" Тогда
		ВключитьПолучениеПланаЗапроса = Ложь;
		ВладелецФормы.ВключеноПолучениеПланаЗапросов = Ложь;
		Элементы.ВключитьПолучениеПланаЗапроса.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СисИнфо = Новый СистемнаяИнформация;
	ЭтоЛинукс = Ложь;
	Если СисИнфо.ТипПлатформы = ТипПлатформы.Linux_x86 или
		СисИнфо.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		ЭтоЛинукс = Истина;
	КонецЕсли;
	ЭтоФайловая = Найти(ВРЕГ(СтрокаСоединенияИнформационнойБазы()),"FILE=")>0;
	
	КаталогНастроек = Новый Файл(КаталогПрограммы()+"conf");
	Если КаталогНастроек.Существует() Тогда
		ФайлКонфигурации = Новый Файл(КаталогНастроек.ПолноеИмя+?(ЭтоЛинукс,"/","\")+"logcfg.xml");
		Если ФайлКонфигурации.Существует() Тогда
			Если ЭтоФайловая Тогда
				КонфигурационныйФайл = РеквизитФормыВЗначение("Объект").ПолучитьМакет("КонфигФайловойВерсии");
				ТекстФайла = КонфигурационныйФайл.ПолучитьТекст();
				ТекстФайла = СтрЗаменить(ТекстФайла,"#ПутьКЛогам#",КаталогВременныхФайлов()+"ZaprosnikTemp");
			Иначе
				КонфигурационныйФайл = РеквизитФормыВЗначение("Объект").ПолучитьМакет("КонфигКлиентСервернойВерсии");
				ТекстФайла = КонфигурационныйФайл.ПолучитьТекст();
				ТекстФайла = СтрЗаменить(ТекстФайла,"#ПутьКЛогам#",КаталогВременныхФайлов()+"ZaprosnikTemp");
			КонецЕсли;
			ТекущийТекст = Новый ТекстовыйДокумент;
			ТекущийТекст.Прочитать(ФайлКонфигурации.ПолноеИмя);
			Если ТекущийТекст.ПолучитьТекст()<>ТекстФайла Тогда
				Элементы.НадписьВключениеТЖ.Заголовок = "Присутствует файл настроек технологического журнала, созданный не для запросника. Он будет сохранён";
				Элементы.НадписьВключениеТЖ.ЦветТекста = WebЦвета.БледноСиреневый;
			Иначе
				Элементы.НадписьВключениеТЖ.Заголовок = "Технологический журнал настроен на работу с запросником.";
				Элементы.НадписьВключениеТЖ.ЦветТекста = WebЦвета.ЗеленыйЛес;
				Элементы.ВключитьТехнологическийЖурнал.Заголовок = "Отключить технологический журнал";
			КонецЕсли;
		Иначе
			Элементы.НадписьВключениеТЖ.Заголовок = "Технологический журнал отключен";
			Элементы.НадписьВключениеТЖ.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
	Иначе
		Элементы.НадписьВключениеТЖ.Заголовок = "Технологический журнал отключен";
		Элементы.НадписьВключениеТЖ.ЦветТекста = WebЦвета.Красный;		
	КонецЕсли;
КонецПроцедуры

