
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Элемент Из Параметры.ОписаниеКолонок Цикл
	
		НоваяСтрока = НастройкаКолонок.Добавить();
		НоваяСтрока.Имя = Элемент.Имя;
		НоваяСтрока.Суммировать = Найти(Элемент.Тип, "Число") > 0;
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Результат = Новый Массив;
	
	Для каждого Элемент Из НастройкаКолонок Цикл
		
		Результат.Добавить(Новый Структура("Имя,Группировать,Суммировать", Элемент.Имя, Элемент.Группировать, Элемент.Суммировать));
		
	КонецЦикла; 
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКолонокГруппироватьПриИзменении(Элемент)
	ТекущиеДанные = Элементы.НастройкаКолонок.ТекущиеДанные;
	ТекущиеДанные.Суммировать = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НастройкаКолонокСуммироватьПриИзменении(Элемент)
	ТекущиеДанные = Элементы.НастройкаКолонок.ТекущиеДанные;
	ТекущиеДанные.Группировать = Ложь;
КонецПроцедуры
