
Процедура КнопкаОбновитьНажатие(Кнопка)
	ОбновитьСтруктуруТаблиц();
КонецПроцедуры

Процедура ОбновитьСтруктуруТаблиц()
	МассивИменМетаданных = Новый Массив();
	ТекстовыйДокумент = ПолучитьСтруктуруТаблицНаСервере(МассивИменМетаданных);
	
	СохрДанные = Новый Структура("СохрТекст, СохрДата");
	СохрДанные.СохрТекст = ТекстовыйДокумент.ПолучитьТекст();
	СохрДанные.СохрДата = ТекущаяДата();
	СохранитьЗначение("СохрДанные", СохрДанные);
	
	ЭлементыФормы.ПолеТекстовогоДокумента1.УстановитьТекст(СохрДанные.СохрТекст);
КонецПроцедуры

Процедура ПриОткрытии()
	
	СохрДанные = ВосстановитьЗначение("СохрДанные");
	Если ЗначениеЗаполнено(СохрДанные) Тогда
		ЭлементыФормы.ПолеТекстовогоДокумента1.УстановитьТекст(СохрДанные.СохрТекст);
		ЭтаФорма.Заголовок = СтрШаблон("Обработка Структура таблиц (кэш от %1)", СохрДанные.СохрДата);
	Иначе
		ОбновитьСтруктуруТаблиц();
	КонецЕсли;
	
КонецПроцедуры
