// Управляет доступностью элементов управления
//
// Параметры:
//	Нет.
//
Процедура вУправлениеДиалогом()

	ЭлементыФормы.НадписьФрмИнтервалАвтосохранения.Доступность = ФрмИспользоватьАвтосохранение;
	ЭлементыФормы.ФрмИнтервалАвтосохранения.Доступность = ФрмИспользоватьАвтосохранение;

КонецПроцедуры // УправлениеДиалогом()

// Обработчик изменения флажка автосохранения
//
Процедура ИспользоватьАвтосохранениеПриИзменении(Элемент)

	Если Не ФрмИспользоватьАвтосохранение Тогда
		ФрмИнтервалАвтосохранения = 0;
	КонецЕсли;
	вУправлениеДиалогом();

КонецПроцедуры // ИспользоватьАвтосохранениеПриИзменении()

// Обработчик нажатия кнопки ОК
//
Процедура КнопкаОКНажатие(Элемент)

	ИспользоватьАвтосохранение = ФрмИспользоватьАвтосохранение;
	ИнтервалАвтосохранения = ФрмИнтервалАвтосохранения;
	ИспользоватьБэкапЗапросов = ФрмИспользоватьБэкапЗапросов;
	ИспользоватьТолькоВыделеннуюОбласть = ФрмИспользоватьтолькоВыделеннуюОбласть;
	моСохранитьНастройки();
	//СохранитьЗначение(ПрефиксНастроек+"ИспользоватьАвтосохранение", ИспользоватьАвтосохранение);
	//СохранитьЗначение(ПрефиксНастроек+"ИнтервалАвтосохранения", ИнтервалАвтосохранения);
	//СохранитьЗначение(ПрефиксНастроек+"ИспользоватьБэкапЗапросов", ИспользоватьБэкапЗапросов);
	//СохранитьЗначение(ПрефиксНастроек+"ИспользоватьТолькоВыделеннуюОбласть", ИспользоватьТолькоВыделеннуюОбласть);
	Закрыть();

КонецПроцедуры // КнопкаОКНажатие()

// Обработчик события перед открытием формы
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	моВосстановитьНастройки();
	ФрмИспользоватьАвтосохранение          = ИспользоватьАвтосохранение;
	ФрмИнтервалАвтосохранения              = ИнтервалАвтосохранения;
	ФрмИспользоватьБэкапЗапросов           = ИспользоватьБэкапЗапросов;
    ФрмИспользоватьтолькоВыделеннуюОбласть = ИспользоватьТолькоВыделеннуюОбласть;

	вУправлениеДиалогом();

КонецПроцедуры // ПередОткрытием()
