Процедура ПриОткрытии()
	
	Для Каждого ЭлементСписка Из Список Цикл
		
		НовСтрока = ТаблицаЗначений.Добавить();
		НовСтрока.Значение = ЭлементСписка.Значение;
		
	КонецЦикла	
	
КонецПроцедуры

Процедура ТаблицаЗначенийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ НоваяСтрока ИЛИ Копирование Тогда Возврат КонецЕсли;
	
	НовСтрока = ЭлементыФормы.ТаблицаЗначений.ТекущаяСтрока;
	НовСтрока.Значение = ТипЗначенияПараметра.ПривестиЗначение();
	
КонецПроцедуры

Процедура КнопкаСохранитьНажатие(Элемент)
	
	СписокВозврата = Новый СписокЗначений;
	
	Для Каждого СтрокаТЗ ИЗ ТаблицаЗначений Цикл
		СписокВозврата.Добавить(СтрокаТЗ.Значение);
	КонецЦикла;	
	
	Закрыть(СписокВозврата);
	
КонецПроцедуры
