//==============================================================================================================================================
// ПЕРЕМЕННЫЕ МОДУЛЯ
//==============================================================================================================================================

//==============================================================================================================================================
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//==============================================================================================================================================

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокЭлементов") Тогда
		
		Заголовок = Параметры.Режим;
		Для Каждого ЭлементСписка Из Параметры.СписокЭлементов Цикл
			СтрокаТЗ = ТаблицаЭлементов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, ЭлементСписка);
		КонецЦикла;
		
		ТаблицаЭлементов.Сортировать("Представление");
		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

//==============================================================================================================================================
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ
//==============================================================================================================================================

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьСнятьФлажки(Истина);
	
КонецПроцедуры // УстановитьФлажки()

//----------------------------------------------------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	УстановитьСнятьФлажки(Ложь);
	
КонецПроцедуры // СнятьФлажки()

//----------------------------------------------------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура ВыбратьЭлементы(Команда)
	
	СписокЭлементов = Новый СписокЗначений;
	Для Каждого СтрокаТЗ Из ТаблицаЭлементов Цикл
		СписокЭлементов.Добавить(СтрокаТЗ.Значение, СтрокаТЗ.Представление, СтрокаТЗ.Пометка);
	КонецЦикла;
	
	Закрыть(СписокЭлементов);
	
КонецПроцедуры // ВыбратьЭлементы()

//==============================================================================================================================================
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ
//==============================================================================================================================================

//==============================================================================================================================================
// КЛИЕНТСКИЕ ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
//==============================================================================================================================================

&НаКлиенте
Процедура УстановитьСнятьФлажки(пПометка)
	
	Для Каждого СтрокаТЗ Из ТаблицаЭлементов Цикл
		СтрокаТЗ.Пометка = пПометка;
	КонецЦикла;
	
КонецПроцедуры // УстановитьСнятьФлажки()

//==============================================================================================================================================
// КЛИЕНТ-СЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
//==============================================================================================================================================

//==============================================================================================================================================
// СЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
//==============================================================================================================================================

//==============================================================================================================================================
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
//==============================================================================================================================================

