
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивРеквизитов = Новый Массив;
	Если Параметры.ЭтоДерево Тогда
		Рез = ДанныеФормыВЗначение(Параметры.РезультатДерево,Тип("ДеревоЗначений"));
		Для Каждого Колонка Из Рез.Колонки Цикл
			Если Колонка.Имя = "СлужебныйРек__" Тогда
				Продолжить;
			КонецЕсли;
			ТекТип = Колонка.ТипЗначения;
			МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, ТекТип, "РезультатДерево")); 
		КонецЦикла;
		ИзменитьРеквизиты(МассивРеквизитов);
		Для Каждого Колонка Из Рез.Колонки Цикл
			Если Колонка.Имя = "СлужебныйРек__" Тогда
				Продолжить;
			КонецЕсли;

			НовыйЭлемент = Элементы.Добавить("РезультатДерево" + Колонка.Имя, Тип("ПолеФормы"), Элементы.РезультатДерево);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "РезультатДерево." + Колонка.Имя;
		КонецЦикла;
		Элементы.РезультатДерево.Видимость = истина;
		ЗначениеВДанныеФормы(Рез,РезультатДерево);
	Иначе
		Рез = Параметры.РезультатТаблица.Выгрузить();
		Для Каждого Колонка Из Рез.Колонки Цикл
			Если Колонка.Имя = "СлужебныйРек__" Тогда
				Продолжить;
			КонецЕсли;
			ТекТип = Колонка.ТипЗначения;
			МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, ТекТип, "РезультатТаблица")); 
		КонецЦикла;
		ИзменитьРеквизиты(МассивРеквизитов);
		Для Каждого Колонка Из Рез.Колонки Цикл
			Если Колонка.Имя = "СлужебныйРек__" Тогда
				Продолжить;
			КонецЕсли;

			НовыйЭлемент = Элементы.Добавить("РезультатТаблица" + Колонка.Имя, Тип("ПолеФормы"), Элементы.РезультатТаблица);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "РезультатТаблица." + Колонка.Имя;
		КонецЦикла;
		Элементы.РезультатТаблица.Видимость = истина;
		ЗначениеВДанныеФормы(Рез,РезультатТаблица);
	КонецЕсли;
КонецПроцедуры
