
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЛевыйВариант = Параметры.Вариант1;
	ПравыйВариант = Параметры.Вариант2;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСлева(Команда)
	ВладелецФормы.Элементы.ПолеHTMLДокументаДляБуфераОбмена.Видимость = Истина;
	ОкноDOM = ВладелецФормы.Элементы.ПолеHTMLДокументаДляБуфераОбмена.Документ.ParentWindow;
	ОкноDOM.ClipboardData.SetData("Text",ЛевыйВариант);
	ВладелецФормы.Элементы.ПолеHTMLДокументаДляБуфераОбмена.Видимость = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСправа(Команда)
	ВладелецФормы.Элементы.ПолеHTMLДокументаДляБуфераОбмена.Видимость = Истина;
	ОкноDOM = ВладелецФормы.Элементы.ПолеHTMLДокументаДляБуфераОбмена.Документ.ParentWindow;
	ОкноDOM.ClipboardData.SetData("Text",ПравыйВариант);
	ВладелецФормы.Элементы.ПолеHTMLДокументаДляБуфераОбмена.Видимость = Ложь;
КонецПроцедуры
