
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура СкопироватьВариант1Нажатие(Элемент)

	Окно = ЭлементыФормы.ПолеHTMLДокументаДляБуфераОбмена.Документ.ParentWindow;
	Окно.ClipboardData.SetData("Text", ЭлементыФормы.Вариант1.ПолучитьТекст());
	
	Закрыть(Истина);
	
КонецПроцедуры

Процедура СкопироватьВариант2Нажатие(Элемент)
	
	Окно = ЭлементыФормы.ПолеHTMLДокументаДляБуфераОбмена.Документ.ParentWindow;
	Окно.ClipboardData.SetData("Text", ЭлементыФормы.Вариант2.ПолучитьТекст());
	
	Закрыть(Истина);
	
КонецПроцедуры

Процедура КнопкаОтменаНажатие(Элемент)
	
	Закрыть(Ложь);
	
КонецПроцедуры
