
Процедура ПриОткрытии()
	
	Заголовок = "Запросник: " + ЭтотОбъект.Метаданные().Комментарий;
	
	ЭлементыФормы.ПолеHTMLДокумента.УстановитьТекст(ПолучитьМакет("Справка").ПолучитьТекст());
	
	ЭлементыФормы.НадписьВерсия.Заголовок = Метаданные().Комментарий;
	
КонецПроцедуры

Процедура НадписьИсторияВерсийНажатие(Элемент)
	
	Если ЭлементыФормы.НадписьИсторияВерсий.Заголовок = "История версий" Тогда
		
		ЭлементыФормы.ПолеHTMLДокумента.УстановитьТекст(ПолучитьМакет("Версии").ПолучитьТекст());
		ЭлементыФормы.НадписьИсторияВерсий.Заголовок = "Верните справку!";
		
	Иначе	
		
		ЭлементыФормы.ПолеHTMLДокумента.УстановитьТекст(ПолучитьМакет("Справка").ПолучитьТекст());
		ЭлементыФормы.НадписьИсторияВерсий.Заголовок = "История версий";
		
	КонецЕсли; 
	
КонецПроцедуры
