// Управляет доступностью элементов управления
//
// Параметры:
//	Нет.
//
Процедура вУправлениеДиалогом()

	ЭлементыФормы.НадписьФрмИнтервалАвтосохранения.Доступность = ФрмИспользоватьАвтосохранение;
	ЭлементыФормы.ФрмИнтервалАвтосохранения.Доступность = ФрмИспользоватьАвтосохранение;

КонецПроцедуры // УправлениеДиалогом()

// Обработчик изменения флажка автосохранения
//
Процедура ИспользоватьАвтосохранениеПриИзменении(Элемент)

	Если Не ФрмИспользоватьАвтосохранение Тогда
		ФрмИнтервалАвтосохранения = 0;
	КонецЕсли;
	вУправлениеДиалогом();

КонецПроцедуры // ИспользоватьАвтосохранениеПриИзменении()

// Обработчик нажатия кнопки ОК
//
Процедура КнопкаОКНажатие(Элемент)

	ИспользоватьАвтосохранение = ФрмИспользоватьАвтосохранение;
	ИнтервалАвтосохранения = ФрмИнтервалАвтосохранения;
    ИспользоватьТолькоВыделеннуюОбласть = ФрмИспользоватьтолькоВыделеннуюОбласть;
    СохранитьЗначение("GROOVY_ИспользоватьАвтосохранение", ИспользоватьАвтосохранение);
    СохранитьЗначение("GROOVY_ИнтервалАвтосохранения", ИнтервалАвтосохранения);
    СохранитьЗначение("GROOVY_ИспользоватьТолькоВыделеннуюОбласть", ИспользоватьТолькоВыделеннуюОбласть);
	Закрыть();

КонецПроцедуры // КнопкаОКНажатие()

// Обработчик события перед открытием формы
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	ФрмИспользоватьАвтосохранение = ИспользоватьАвтосохранение;
	ФрмИнтервалАвтосохранения = ИнтервалАвтосохранения;
    ФрмИспользоватьтолькоВыделеннуюОбласть = ИспользоватьТолькоВыделеннуюОбласть;

	вУправлениеДиалогом();

КонецПроцедуры // ПередОткрытием()
