
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	МассивИменМетаданных = Новый Массив();
	
	// Если нужна структура таблиц только некоторых объектов конфигурации
	// их можно перечислить в массиве имен метаданных
	
	//МассивИменМетаданных.Добавить("Справочник.Номенклатура");
	//МассивИменМетаданных.Добавить("Документ.РеализацияТоваровУслуг");
	ТекстовыйДокумент = ПолучитьСтруктуруТаблицНаСервере(МассивИменМетаданных);
	ЭлементыФормы.ПолеТекстовогоДокумента1.УстановитьТекст(ТекстовыйДокумент.ПолучитьТекст());
	
КонецПроцедуры
