Перем ОсновнаяФорма Экспорт;

Процедура ПриОткрытии()
	
	ЭлементыФормы.ТекстЗапроса.УстановитьТекст(ТекстЗапроса);;
	
КонецПроцедуры

Процедура КнопкаСохранитьИзмененияНажатие(Элемент)
	
	СохранитьИзменения();
	Закрыть();
	
КонецПроцедуры

Процедура КнопкаКонструкторНажатие(Элемент)
	
	КонструкторЗапроса = Новый КонструкторЗапроса;
	КонструкторЗапроса.АвтодобавлениеПредставлений = Ложь;
	Попытка
		ТекстЗапросаКонструктор = ЭлементыФормы.ТекстЗапроса.ПолучитьТекст();
		Если ТекстЗапросаКонструктор <> "" Тогда
			КонструкторЗапроса.Текст = ЭлементыФормы.ТекстЗапроса.ПолучитьТекст();
		КонецЕсли;
		
		Если КонструкторЗапроса.ОткрытьМодально() Тогда
			ЭлементыФормы.ТекстЗапроса.УстановитьТекст(КонструкторЗапроса.Текст);
		КонецЕсли;
	Исключение
        Предупреждение(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура КнопкаОтменаНажатие(Элемент)
	Закрыть()
КонецПроцедуры

Процедура СохранитьИзменения()

	ОсновнаяФорма.ЭлементыФормы.ТекстЗапроса.УстановитьТекст(ЭлементыФормы.ТекстЗапроса.ПолучитьТекст());
	ОсновнаяФорма.Модифицированность = Истина;

КонецПроцедуры //СохранитьИзменения
 