
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокПараметров = ВладелецФормы.ВременныеТаблицы;
	Для Каждого Параметр Из СписокПараметров Цикл
		НоваяСтрока = ВременныеТаблицы.Добавить();
		НоваяСтрока.Таблица = Параметр.Таблица;
		НоваяСтрока.ВремяВыполнения = Параметр.ВремяВыполнения;
		НоваяСтрока.КоличествоСтрок = Параметр.КоличествоСтрок;
		НоваяСтрока.ТекстЗапроса = Параметр.ТекстЗапроса;
		НоваяСтрока.Отладить = Параметр.Отладить;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВременныеТаблицыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	//Если Элемент
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Таблица",ВременныеТаблицы.НайтиПоИдентификатору(ВыбраннаяСтрока).Таблица);
	СтруктураВозврата.Вставить("Отладка",Ложь);
	Если Поле.Имя = "ВременныеТаблицыОтладить" Тогда
		СтруктураВозврата.Отладка = Истина;
		Закрыть(СтруктураВозврата);
	Иначе
		Закрыть(СтруктураВозврата);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВременныеТаблицыОтладитьОткрытие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

