&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ИдентификаторСтрокой = Параметры.УИД;
	Элементы.ИдентификаторСтрокой.Маска = "hhhhhhhh-hhhh-hhhh-hhhh-hhhhhhhhhhhh";
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаОбъектПриИзменении(Элемент)
	
	СсылкаНаОбъектПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СсылкаНаОбъектПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(ЭтотОбъект.СсылкаНаОбъект) Тогда
		ЭтотОбъект.ИдентификаторСтрокой = ЭтотОбъект.СсылкаНаОбъект.УникальныйИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
		
	ОповеститьОВыборе(Новый УникальныйИдентификатор(ЭтотОбъект.ИдентификаторСтрокой));
	
КонецПроцедуры





