
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.МножественныйВыбор = Параметры.МножественныйВыбор;
	
	Для Каждого ИмяТаблицы Из Параметры.ВременныеТаблицы Цикл
		НовСтр = ЭтотОбъект.Таблицы.Добавить();
		НовСтр.ИмяТаблицы = ИмяТаблицы;
	КонецЦикла;
	
	Если Параметры.Свойство("ИмяТаблицы") Тогда
		ИскомаяСтрока = ЭтотОбъект.Таблицы.НайтиСтроки(Новый Структура("ИмяТаблицы", Параметры.ИмяТаблицы))[0];
		ИскомаяСтрока.Выбор = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ПараметрЗакрытия = Новый Массив();
	Для Каждого Строка Из ЭтотОбъект.Таблицы Цикл
		Если Строка.Выбор Тогда
			ПараметрЗакрытия.Добавить(Строка.ИмяТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Если ПараметрЗакрытия.Количество() = 0 Тогда
		Сообщить("Не выбрана таблица");
		Возврат;
	КонецЕсли;  
	
	ЭтотОбъект.Закрыть(ПараметрЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыВыборПриИзменении(Элемент)
	
	ТекДанные = Элементы.Таблицы.ТекущиеДанные;
	Если ТекДанные.Выбор И Не ЭтотОбъект.МножественныйВыбор Тогда
		Для Каждого Строка Из ЭтотОбъект.Таблицы Цикл
			Если Строка <> ТекДанные Тогда
				Строка.Выбор = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
