&НаКлиенте
Перем ТекДанные;
&НаКлиенте
Процедура Сохранить(Команда)
	// Вставить содержимое обработчика.
	ТекДанные.ЗначениеПараметра = СписокЗначений.Скопировать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекДанные = ВладелецФормы.ПараметрыЗапроса.НайтиПоИдентификатору(ВладелецФормы.Элементы.ПараметрыЗапроса.ТекущаяСтрока);
    Массив = Новый Массив;
	
	Если ТипЗнч(ТекДанные.ЗначениеПараметра) = Тип("СписокЗначений") Тогда
		СписокЗначений = ТекДанные.ЗначениеПараметра.Скопировать();
		Если СписокЗначений.Количество()>0 Тогда
			Массив.Добавить(ТипЗнч(СписокЗначений[0].Значение));
		КонецЕсли;
	Иначе	
		Если ЗначениеЗаполнено(ТекДанные.ЗначениеПараметра) Тогда
			СписокЗначений.Добавить(ТекДанные.ЗначениеПараметра);
		КонецЕсли;
		Массив.Добавить(ТипЗнч(ТекДанные.ЗначениеПараметра));
	КонецЕсли;	
	ТипЗначенияПараметра = Новый ОписаниеТипов(Массив);
	ЭтаФорма.Заголовок = "Список значений параметра " + ТекДанные.ИмяПараметра;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НЕ НоваяСтрока ИЛИ Копирование Тогда Возврат КонецЕсли;
	
	НовСтрока = СписокЗначений.НайтиПоИдентификатору(Элементы.СписокЗначений.ТекущаяСтрока);
	НовСтрока.Значение = ТипЗначенияПараметра.ПривестиЗначение();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
