
&НаКлиенте
Перем КонецПериодаУказанРуками;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = Параметры.НачалоПериода;
	КонецПериода = Параметры.КонецПериода;
	
	Для каждого Элемент Из Параметры.НаборПараметров Цикл
		НоваяСтрока = ПривязкаПараметров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ПривязкаПараметров.Количество() = 0 Тогда
		//ПоказатьПредупреждение(, "Отсутствуют параметры с датой!");
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отсутствуют параметры с датой!";
		Сообщение.Сообщить(); 
	    Отказ = Истина;
	КонецЕсли;

	Элементы.ПолеКалендарь.РежимВыделения = РежимВыделенияДаты.Одиночный;
	
	ИмяТекущегоПериода = ОпределитьПериод(НачалоПериода, КонецПериода);
	
	Если НЕ ПустаяСтрока(ИмяТекущегоПериода) Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы[ИмяТекущегоПериода];
	КонецЕсли; 
	
	Год = Макс(Год(НачалоПериода), Год(КонецПериода));
	
	Год = ?(Год = 1, Год(ТекущаяДата()), Год);
	
	УстановитьПериод();
	
	ОтобразитьМесяцНаКалендаре(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязкаПараметровСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПривязкаПараметров.ТекущиеДанные;
	
	Если ТекущиеДанные.С Тогда
	
		ТекущиеДанные.По = Ложь;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязкаПараметровПоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПривязкаПараметров.ТекущиеДанные;
	
	Если ТекущиеДанные.По Тогда
	
		ТекущиеДанные.С = Ложь;
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ГодПрибавить(Команда)
	Год = Год + 1;
	УстановитьПериод(1);
КонецПроцедуры

&НаКлиенте
Процедура ГодУбавить(Команда)
	Год = Год - 1;
	УстановитьПериод(-1);
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьГод(Команда)
	
	ИмяТекущегоПериода = "ВыбратьГод";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПолугодие1(Команда)
	
	ИмяТекущегоПериода = "ВыбратьПолугодие1";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПолугодие2(Команда)
	
	ИмяТекущегоПериода = "ВыбратьПолугодие2";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКвартал1(Команда)
	
	ИмяТекущегоПериода = "ВыбратьКвартал1";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКвартал2(Команда)
	
	ИмяТекущегоПериода = "ВыбратьКвартал2";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКвартал3(Команда)
	
	ИмяТекущегоПериода = "ВыбратьКвартал3";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКвартал4(Команда)
	
	ИмяТекущегоПериода = "ВыбратьКвартал4";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКвартал1_3(Команда)
	
	ИмяТекущегоПериода = "ВыбратьКвартал1_3";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(СмещениеГода = 0)
	
	ФонКнопокПоУмолчанию();
	
	Год = ?(Год = 1 ИЛИ Год = 3999, Год(ТекущаяДата()), Год);
	
	Если ИмяТекущегоПериода = "ВыбратьГод" Тогда
		НачалоПериода = Дата(Год, 1, 1);
		КонецПериода = Дата(Год, 12, 31, 23, 59, 59);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьПолугодие1" Тогда
		НачалоПериода = Дата(Год, 1, 1);
		КонецПериода = Дата(Год, 6, 30, 23, 59, 59);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьПолугодие2" Тогда
		НачалоПериода = Дата(Год, 7, 1);
		КонецПериода = Дата(Год, 12, 31, 23, 59, 59);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьКвартал1" Тогда
		НачалоПериода = Дата(Год, 1, 1);
		КонецПериода = Дата(Год, 3, 31, 23, 59, 59);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьКвартал2" Тогда
		НачалоПериода = Дата(Год, 4, 1);
		КонецПериода = Дата(Год, 6, 30, 23, 59, 59);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьКвартал3" Тогда
		НачалоПериода = Дата(Год, 7, 1);
		КонецПериода = Дата(Год, 9, 30, 23, 59, 59);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьКвартал4" Тогда
		НачалоПериода = Дата(Год, 10, 1);
		КонецПериода = Дата(Год, 12, 31, 23, 59, 59);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьКвартал1_3" Тогда
		НачалоПериода = Дата(Год, 1, 1);
		КонецПериода = Дата(Год, 9, 30, 23, 59, 59);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьМесяц1" Тогда
		НачалоПериода = Дата(Год, 1, 1);
		КонецПериода = КонецМесяца(НачалоПериода);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьМесяц2" Тогда
		НачалоПериода = Дата(Год, 2, 1);
		КонецПериода = КонецМесяца(НачалоПериода);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьМесяц3" Тогда
		НачалоПериода = Дата(Год, 3, 1);
		КонецПериода = КонецМесяца(НачалоПериода);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьМесяц4" Тогда
		НачалоПериода = Дата(Год, 4, 1);
		КонецПериода = КонецМесяца(НачалоПериода);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьМесяц5" Тогда
		НачалоПериода = Дата(Год, 5, 1);
		КонецПериода = КонецМесяца(НачалоПериода);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьМесяц6" Тогда
		НачалоПериода = Дата(Год, 6, 1);
		КонецПериода = КонецМесяца(НачалоПериода);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьМесяц7" Тогда
		НачалоПериода = Дата(Год, 7, 1);
		КонецПериода = КонецМесяца(НачалоПериода);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьМесяц8" Тогда
		НачалоПериода = Дата(Год, 8, 1);
		КонецПериода = КонецМесяца(НачалоПериода);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьМесяц9" Тогда
		НачалоПериода = Дата(Год, 9, 1);
		КонецПериода = КонецМесяца(НачалоПериода);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьМесяц10" Тогда
		НачалоПериода = Дата(Год, 10, 1);
		КонецПериода = КонецМесяца(НачалоПериода);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьМесяц11" Тогда
		НачалоПериода = Дата(Год, 11, 1);
		КонецПериода = КонецМесяца(НачалоПериода);
	ИначеЕсли ИмяТекущегоПериода = "ВыбратьМесяц12" Тогда
		НачалоПериода = Дата(Год, 12, 1);
		КонецПериода = КонецМесяца(НачалоПериода);
	Иначе
		Если СмещениеГода = 1 Тогда
		    НачалоПериода = Дата(Год(НачалоПериода) + 1, Месяц(НачалоПериода), День(НачалоПериода));
		    КонецПериода = Дата(Год(КонецПериода) + 1, Месяц(КонецПериода), День(КонецПериода));
		ИначеЕсли СмещениеГода = -1 Тогда
		    НачалоПериода = Дата(Год(НачалоПериода) - 1, Месяц(НачалоПериода), День(НачалоПериода));
		    КонецПериода = Дата(Год(КонецПериода) - 1, Месяц(КонецПериода), День(КонецПериода));
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(ИмяТекущегоПериода) Тогда
		Элементы[ИмяТекущегоПериода].ЦветФона = Новый Цвет(255, 204, 0);
	КонецЕсли; 
	
	ОтобразитьМесяцНаКалендаре(Неопределено);
	
КонецПроцедуры // УстановитьПериод()

&НаКлиенте
Процедура ВыбратьМесяц1(Команда)
	
	ИмяТекущегоПериода = "ВыбратьМесяц1";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц2(Команда)
	
	ИмяТекущегоПериода = "ВыбратьМесяц2";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц3(Команда)
	
	ИмяТекущегоПериода = "ВыбратьМесяц3";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц4(Команда)
	
	ИмяТекущегоПериода = "ВыбратьМесяц4";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц5(Команда)
	
	ИмяТекущегоПериода = "ВыбратьМесяц5";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц6(Команда)
	
	ИмяТекущегоПериода = "ВыбратьМесяц6";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц7(Команда)
	
	ИмяТекущегоПериода = "ВыбратьМесяц7";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц8(Команда)
	
	ИмяТекущегоПериода = "ВыбратьМесяц8";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц9(Команда)
	
	ИмяТекущегоПериода = "ВыбратьМесяц9";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц10(Команда)
	
	ИмяТекущегоПериода = "ВыбратьМесяц10";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц11(Команда)
	
	ИмяТекущегоПериода = "ВыбратьМесяц11";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц12(Команда)
	
	ИмяТекущегоПериода = "ВыбратьМесяц12";
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьМесяцНаКалендаре(Команда)
	
	Элементы.ПолеКалендарь.Доступность = НачалоМесяца(НачалоПериода) = НачалоМесяца(КонецПериода);
	
	Если Элементы.ПолеКалендарь.Доступность Тогда
		ДатаСч = НачалоДня(НачалоПериода);
		Пока ДатаСч <= НачалоДня(КонецПериода) Цикл
			Элементы.ПолеКалендарь.ВыделенныеДаты.Добавить(ДатаСч);
			ДатаСч = ДатаСч + 60 * 60 * 24;
		КонецЦикла;
	Иначе
		Элементы.ПолеКалендарь.ВыделенныеДаты.Очистить();
	КонецЕсли; 
	
	Элементы.ПолеКалендарь.НачалоПериодаОтображения = НачалоМесяца(КонецПериода);
	Элементы.ПолеКалендарь.КонецПериодаОтображения = КонецМесяца(КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриИзменении(Элемент)
	
	Количество = Элементы.ПолеКалендарь.ВыделенныеДаты.Количество();
	
	Если Количество > 0 Тогда
		
		Дата1 = Элементы.ПолеКалендарь.ВыделенныеДаты[0];
		Дата2 = Элементы.ПолеКалендарь.ВыделенныеДаты[Количество - 1];
		
		НачалоПериода = Мин(Дата1, Дата2);
		КонецПериода = КонецДня(Макс(Дата1, Дата2));
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьПериод(Знач лНачалоПериода, Знач лКонецПериода)
	
	Если лНачалоПериода = Неопределено ИЛИ лКонецПериода = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	лНачалоПериода = НачалоДня(лНачалоПериода);
	лКонецПериода = КонецДня(лКонецПериода);
	
	Год1 = Год(лНачалоПериода);
	Год2 = Год(лКонецПериода);
	День1 = День(лНачалоПериода);
	День2 = День(лКонецПериода);
	
	Если Не Год1 = Год2 ИЛИ НЕ День1 = 1 ИЛИ НЕ День(КонецДня(лКонецПериода)+1) = 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Месяц1 = Месяц(лНачалоПериода);
	Месяц2 = Месяц(лКонецПериода);
	
	Если Месяц1 = Месяц2 Тогда
		ИмяКнопки = "ВыбратьМесяц" + Месяц1;
	ИначеЕсли Месяц1 = 1 И Месяц2 = 12 Тогда
		ИмяКнопки = "ВыбратьГод";
	ИначеЕсли Месяц1 = 1 И Месяц2 = 6 Тогда
		ИмяКнопки = "ВыбратьПолугодие1";
	ИначеЕсли Месяц1 = 7 И Месяц2 = 12 Тогда
		ИмяКнопки = "ВыбратьПолугодие2";
	ИначеЕсли Месяц1 = 1 И Месяц2 = 3 Тогда
		ИмяКнопки = "ВыбратьКвартал1";
	ИначеЕсли Месяц1 = 4 И Месяц2 = 6 Тогда
		ИмяКнопки = "ВыбратьКвартал2";
	ИначеЕсли Месяц1 = 7 И Месяц2 = 9 Тогда
		ИмяКнопки = "ВыбратьКвартал3";
	ИначеЕсли Месяц1 = 10 И Месяц2 = 12 Тогда
		ИмяКнопки = "ВыбратьКвартал4";
	ИначеЕсли Месяц1 = 1 И Месяц2 = 9 Тогда
		ИмяКнопки = "ВыбратьКвартал1_3";
	КонецЕсли; 
	
	Возврат ИмяКнопки;

КонецФункции

&НаКлиенте
Процедура ФонКнопокПоУмолчанию()
	
	ЦветФонаШапкиОтчета = Новый Цвет(244, 236, 197);	
	
	Элементы.ВыбратьГод.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьПолугодие1.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьПолугодие2.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьКвартал1.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьКвартал2.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьКвартал3.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьКвартал4.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьКвартал1_3.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьМесяц1.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьМесяц2.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьМесяц3.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьМесяц4.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьМесяц5.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьМесяц6.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьМесяц7.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьМесяц8.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьМесяц9.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьМесяц10.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьМесяц11.ЦветФона = ЦветФонаШапкиОтчета;
	Элементы.ВыбратьМесяц12.ЦветФона = ЦветФонаШапкиОтчета;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ИмяТекущегоПериода = ОпределитьПериод(НачалоПериода, КонецПериода);
	
	УстановитьПериод();
	
	ОтобразитьМесяцНаКалендаре(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	Если КонецПериодаУказанРуками Тогда
		КонецПериодаУказанРуками = Ложь;
	Иначе	
		КонецПериода = КонецДня(КонецПериода);
	КонецЕсли;
	
	ИмяТекущегоПериода = ОпределитьПериод(НачалоПериода, КонецПериода);
	
	УстановитьПериод();
	
	ОтобразитьМесяцНаКалендаре(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	
	УстановитьПериод(0);

КонецПроцедуры

&НаКлиенте
Функция СоздатьРезультат()
	
	Результат = Новый Структура("НачалоПериода,КонецПериода,ВыполнитьЗапрос", НачалоПериода, КонецПериода, Ложь);
	Результат.Вставить("КоллекцияПараметров", Новый Структура);

	Для каждого Элемент Из ПривязкаПараметров Цикл
		Результат.КоллекцияПараметров.Вставить(Элемент.Параметр, Новый Структура("С, По", Элемент.С, Элемент.По));
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Ок(Команда)
	
	Если НачалоПериода > КонецПериода Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка! 'Начало периода' больше 'Конца периода'.";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;
	
	Результат = СоздатьРезультат(); 
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	
	Если НачалоПериода > КонецПериода Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка! 'Начало периода' больше 'Конца периода'.";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;
	
	Результат = СоздатьРезультат();
	Результат.ВыполнитьЗапрос = Истина;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКалендарь(Команда)
	Элементы.ПолеКалендарь.Видимость = НЕ Элементы.ПолеКалендарь.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	КонецПериодаУказанРуками = Истина;
	
КонецПроцедуры

КонецПериодаУказанРуками = Ложь;