
&НаКлиенте
Процедура ВывестиСтруктуруТаблиц(Команда)
	
	МассивИменМетаданных = Новый Массив();
	
	// Если нужна структура таблиц только некоторых объектов конфигурации
	// их можно перечислить в массиве имен метаданных
	
	//МассивИменМетаданных.Добавить("Справочник.Номенклатура");
	//МассивИменМетаданных.Добавить("Документ.РеализацияТоваровУслуг");
	
	ТекстовыйДокумент = ПолучитьСтруктуруТаблицНаСервере(МассивИменМетаданных);
	
	//ТекстовыйДокумент.Показать("Структура хранения базы данных");

КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруТаблицНаСервере(МассивИменМетаданных)
	
	ТекстовыйДокумент = РеквизитФормыВЗначение("Объект").ПолучитьСтруктуруТаблицНаСервере(МассивИменМетаданных);
	
	Возврат ТекстовыйДокумент;
	
КонецФункции	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МассивИменМетаданных = Новый Массив();
	
	// Если нужна структура таблиц только некоторых объектов конфигурации
	// их можно перечислить в массиве имен метаданных
	
	//МассивИменМетаданных.Добавить("Справочник.Номенклатура");
	//МассивИменМетаданных.Добавить("Документ.РеализацияТоваровУслуг");
	
	ТекстовыйДокумент = ПолучитьСтруктуруТаблицНаСервере(МассивИменМетаданных);
	
	//ТекстовыйДокумент.Показать("Структура хранения базы данных");
КонецПроцедуры
