
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ПараметрГраница = Неопределено;
    Отбор = Неопределено;
    Если Параметры.Свойство("ПараметрГраница", ПараметрГраница) Тогда
        
        М = Новый Массив(); 
        Если ТипЗнч(ПараметрГраница) = Тип("Дата") Тогда
            М.Добавить(ТипЗнч(ПараметрГраница));
        ИначеЕсли ТипЗнч(ПараметрГраница) = Тип("Граница") Тогда
            Если ТипЗнч(ПараметрГраница.Значение) = Тип("Дата") Тогда
                М.Добавить(Тип("Дата"));
                Элементы.Дата.ОграничениеТипа = Новый ОписаниеТипов(М);
                ЭтаФорма.Дата = ПараметрГраница.Значение;
            ИначеЕсли ТипЗнч(ПараметрГраница.Значение) = Тип("МоментВремени") Тогда
                М.Добавить(ТипЗнч(ПараметрГраница.Значение.Ссылка));
                Элементы.Дата.ОграничениеТипа = Новый ОписаниеТипов(М);
                ЭтаФорма.Дата = ПараметрГраница.Значение.Ссылка;
            КонецЕсли; 
            ЭтаФорма.ЭтотВидГраницы = Строка(ПараметрГраница.ВидГраницы);
         Иначе
        	Элементы.Дата.ОграничениеТипа = Новый ОписаниеТипов(ПолучитьтипВсехДокументов(), "Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
        КонецЕсли; 
        
	ИначеЕсли Параметры.Свойство("ОтборПараметрЗапроса", Отбор) Тогда
		
		пХранилище = ПолучитьИзВременногоХранилища(Параметры.ОбъектПутьКХранилищу);
		ТабПараметров = пХранилище.ТабПараметров;
		
		Строкапараметра = ТабПараметров.НайтиСтроки(Отбор)[0];

		ОписаниеТипаГраница = Новый ОписаниеТипов("Граница");
		ПараметрГраница = ОписаниеТипаГраница.ПривестиЗначение(Строкапараметра.Значение);
		
		Элементы.Дата.ОграничениеТипа = Новый ОписаниеТипов(ПолучитьтипВсехДокументов(), "Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
        ЭтаФорма.ЭтотВидГраницы = Строка(ПараметрГраница.ВидГраницы);
		Если ТипЗнч(ПараметрГраница.Значение) = Тип("Дата") Тогда
			ЭтаФорма.Дата = ПараметрГраница.Значение;
		ИначеЕсли ПараметрГраница.Значение = Неопределено Тогда
			ЭтаФорма.Дата = Дата(1,1,1);
		Иначе	
			ЭтаФорма.Дата = ПараметрГраница.Значение.Ссылка;
		КонецЕсли; 
		
    Иначе
    	Элементы.Дата.ОграничениеТипа = Новый ОписаниеТипов(ПолучитьтипВсехДокументов(), "Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ВидГраницыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    Список = Новый СписокЗначений;
    Список.Добавить("Включая");
    Список.Добавить("Исключая");
	
	//Знч = ВыбратьИзСписка(Список, Элемент, Список.НайтиПоЗначению(ЭтаФорма.ЭтотВидГраницы));
	//Если Знч <> Неопределено Тогда
	//	ЭтаФорма.ЭтотВидГраницы = Знч.Значение;
	//КонецЕсли; 
	
	//Если Лев(Объект.ВерсияПриложения, 3) = "8.2" Тогда
	Если Объект.МодальностьРазрешена Тогда
		//8.2
		КодВыполнения = "
		|Значение = ВыбратьИзСписка(Список, Элемент, Список.НайтиПоЗначению(ЭтаФорма.ЭтотВидГраницы));
		|ВидГраницыНачалоВыбораЗавершение(Значение, Неопределено);";
	Иначе
		// Такси
		КодВыполнения = "
		|Оповещение = Новый ОписаниеОповещения(""ВидГраницыНачалоВыбораЗавершение"", ЭтаФорма);
		|ПоказатьВыборИзСписка(Оповещение, Список, Элемент, Список.НайтиПоЗначению(ЭтаФорма.ЭтотВидГраницы));"; 
	КонецЕсли;
	
	Выполнить(КодВыполнения);

КонецПроцедуры

&НаКлиенте
Процедура ВидГраницыНачалоВыбораЗавершение(Значение, Параметры) Экспорт

	Если Значение <> Неопределено Тогда
		ЭтаФорма.ЭтотВидГраницы = Значение.Значение;
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
    
    Если ЗначениеЗаполнено(ЭтаФорма.Дата) Тогда
        М = Новый Массив(); 
        Если ТипЗнч(ЭтаФорма.Дата) = Тип("Дата") Тогда
            М.Добавить(ТипЗнч(ЭтаФорма.Дата));
        ИначеЕсли ТипЗнч(ЭтаФорма.Дата) = Тип("Граница") 
            И ЗначениеЗаполнено(ЭтаФорма.Дата) Тогда
            М.Добавить(ТипЗнч(ЭтаФорма.Дата.Ссылка));
        ИначеЕсли ЭтоСсылкаНаДокумент(ЭтаФорма.Дата) Тогда
            М.Добавить(ТипЗнч(ЭтаФорма.Дата));
        КонецЕсли; 
    	Элемент.ОграничениеТипа = Новый ОписаниеТипов(М);
    Иначе    
    	Элемент.ОграничениеТипа = Новый ОписаниеТипов(ПолучитьтипВсехДокументов(), "Дата", , , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьтипВсехДокументов()

	Возврат Новый ОписаниеТипов(Документы.ТипВсеСсылки().Типы());

КонецФункции // ПолучитьтипВсехДокументов()

&НаСервере
Функция ЭтоСсылкаНаДокумент(Значение)

	Возврат Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Значение));

КонецФункции // ПолучитьтипВсехДокументов()

&НаКлиенте
Процедура Ок(Команда)
    
	СтрокаПредставления = "";
	ОкНаСервере(СтрокаПредставления);
	Закрыть(СтрокаПредставления);
	
КонецПроцедуры

&НаСервере
Процедура ОкНаСервере(СтрокаПредставления)
    
    Парам = Новый Массив(2);
    Парам[0] = ?(ТипЗнч(ЭтаФорма.Дата) = Тип("Дата"), ЭтаФорма.Дата, ЭтаФорма.Дата.МоментВремени());
    Парам[1] = ВидГраницы[ЭтаФорма.ЭтотВидГраницы];
    Граница = Новый(Тип("Граница"),Парам);

	Если Параметры.ОтборПараметрЗапроса <> Неопределено Тогда
		
		пХранилище = ПолучитьИзВременногоХранилища(Параметры.ОбъектПутьКХранилищу);
		ТабПараметров = пХранилище.ТабПараметров;
		
		Строкапараметра = ТабПараметров.НайтиСтроки(Параметры.ОтборПараметрЗапроса)[0];
		
		Строкапараметра.Значение = Граница;
		СтрокаПредставления = Строка(ЭтаФорма.ЭтотВидГраницы) + ":" + Строка(Парам[0]);
		Возврат;

	КонецЕсли;
	
	СтрокаПредставления = Граница;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры
	
СисИнфо = Новый СистемнаяИнформация;
Объект.ВерсияПриложения = СисИнфо.ВерсияПриложения;

