#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	
	УКО_ФормыКлиентСервер_Заголовок(ЭтаФорма, НСтр("ru = 'Экспорт в'; en = 'Export to'"));
	
	Имя = ИмяФайлаВыводаРезультата();
	
	СписокФорматов = Новый СписокЗначений;
	СписокФорматов.Добавить("XLSX", "Excel 2007",, Элементы.БиблиотекаКартинокУКО_Excel.Картинка);
	СписокФорматов.Добавить("MXL", "MXL");
	СписокФорматов.Добавить("PDF", "PDF");
	
	Если Не ЗначениеЗаполнено(Формат) Тогда
		Формат = "XLSX";
	КонецЕсли;
	
	Для Каждого ЭлементФормат Из СписокФорматов Цикл 
		
		ИмяКоманды = ЭлементФормат.Значение;
		
		НоваяКоманда = Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Заголовок = ЭлементФормат.Представление;
		НоваяКоманда.Картинка = ЭлементФормат.Картинка;
		НоваяКоманда.Действие = "КомандаФормат";
		
		НовыйЭлемент = Элементы.Добавить("Кнопка" + ИмяКоманды, Тип("КнопкаФормы"), Элементы.Формат);
		НовыйЭлемент.ИмяКоманды = ИмяКоманды;
		НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЭлементыУправления();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталога.Каталог = Каталог;
	
	ДиалогВыбораКаталога.Показать(Новый ОписаниеОповещения("ЗавершенВыборКаталога", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	
	ОбновитьЭлементыУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогПриИзменении(Элемент)
	
	ОбновитьЭлементыУправления();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаФормат(Команда)
	
	Формат = Команда.Имя;
	ОбновитьЭлементыУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортВ(Команда)
	
	ПоляОшибокЗаполнения = ПроверкаЗаполнения();
	Если ЗначениеЗаполнено(ПоляОшибокЗаполнения) Тогда
		
		ТекущийЭлемент = Элементы[ПоляОшибокЗаполнения[0]];
		
	Иначе
		
		Результат = Новый Структура;
		Результат.Вставить("ПолноеИмяФайла", СтрШаблон("%1\%2.%3", Каталог, Имя, РасширениеПоТипу(Формат)));
		Результат.Вставить("Формат", Формат);
		Результат.Вставить("ОткрытьПослеСохранения", ОткрытьПослеСохранения);
		
		Закрыть(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция РасширениеПоТипу(ИмяФормата)
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("XLS", "xls");
	Соответствие.Вставить("XLSX", "xlsx");
	Соответствие.Вставить("MXL", "mxl");
	Соответствие.Вставить("PDF", "pdf");
	Соответствие.Вставить("DOCX", "docx");
	Соответствие.Вставить("HTML5", "html");
	Соответствие.Вставить("ODS", "ods");
	
	Возврат Соответствие.Получить(ИмяФормата);
	
КонецФункции

&НаКлиенте
Процедура ЗавершенВыборКаталога(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Каталог = Результат[0];
	КаталогПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыУправления()
	
	Для Каждого КнопкаФормат Из Элементы.Формат.ПодчиненныеЭлементы Цикл 
		КнопкаФормат.Пометка = (Формат = КнопкаФормат.ИмяКоманды);
	КонецЦикла;
	
	Расширение = "." + РасширениеПоТипу(Формат);
	
	// Ошибки
	ТекстОшибки = "";
	ПоляОшибокЗаполнения = ПроверкаЗаполнения();
	Если ЗначениеЗаполнено(ПоляОшибокЗаполнения) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не заполнен(ы): %1'; en = 'Not filled:%1'"), СтрСоединить(ПоляОшибокЗаполнения, ", "));
	КонецЕсли;
		
	Ошибки = ТекстОшибки;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполнения()
	
	Результат = Новый Массив;
	Если Не ЗначениеЗаполнено(Имя) Тогда
		Результат.Добавить(НСтр("ru = 'Имя'; en = 'Name'"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Каталог) Тогда
		Результат.Добавить(НСтр("ru = 'Каталог'; en = 'Catalog'"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если Не ЗначениеЗаполнено(Настройки["Формат"]) Тогда
		Настройки.Вставить("Формат", "XLSX");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Настройки["Имя"]) Тогда
		Настройки.Вставить("Имя", ИмяФайлаВыводаРезультата());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФайлаВыводаРезультата()
	
	Возврат НСтр("ru = 'Результат'; en = 'Result'");
	
КонецФункции

#КонецОбласти


&НаСервере
Функция ОбъектОбработки()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции
&НаКлиентеНаСервереБезКонтекста
// Обновляет заголовок формы
//
// Параметры:
//  Форма - Форма - Форма
//  Заголовок - Строка - Заголовок формы
//  Дополнение - Булево - Дополнять заголовок названием расширения
//
Процедура УКО_ФормыКлиентСервер_Заголовок(Форма, Заголовок, Дополнение = Ложь) Экспорт
	
	НовыйЗаголовок = Заголовок;
	
	Если Дополнение Тогда
		НовыйЗаголовок = НовыйЗаголовок + " : " + УКО_ОбщегоНазначенияКлиентСервер_ИмяРасширения();
	КонецЕсли;
	
	Форма.Заголовок = НовыйЗаголовок;
	
КонецПроцедуры
&НаКлиентеНаСервереБезКонтекста
// Возвращает имя расширения
// Возвращаемое значение:
//   Строка	- Имя расширения
Функция УКО_ОбщегоНазначенияКлиентСервер_ИмяРасширения() Экспорт 
	
	Возврат НСтр("ru = 'Управляемая консоль отчетов'; en = 'Managed reporting console'");
	
КонецФункции
