
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ПараметрСсылка = Неопределено;
    Отбор = Неопределено;
    Если Параметры.Свойство("ПараметрСсылка", ПараметрСсылка) Тогда
        ЭтаФорма.Ссылка = ПараметрСсылка;
        М = Новый Массив(); 
        М.Добавить(ТипЗнч(ПараметрСсылка));
    	Элементы.Ссылка.ОграничениеТипа = Новый ОписаниеТипов(М);
    
	ИначеЕсли Параметры.Свойство("ОтборПараметрЗапроса", Отбор) Тогда
		
		пХранилище = ПолучитьИзВременногоХранилища(Параметры.ОбъектПутьКХранилищу);
		ТабПараметров = пХранилище.ТабПараметров;
		
		Строкапараметра = ТабПараметров.НайтиСтроки(Отбор)[0];
		
		ОписаниеТипаМВ = Новый ОписаниеТипов("МоментВремени");
		ПараметрМВ = ОписаниеТипаМВ.ПривестиЗначение(Строкапараметра.Значение);
		
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ПараметрМВ.Ссылка)) Тогда
			М = Новый Массив(); 
			М.Добавить(ТипЗнч(ПараметрСсылка));
			ТипОграничения = Новый ОписаниеТипов(М);
		Иначе
			ТипыВсехДокументов = Новый ОписаниеТипов(Документы.ТипВсеСсылки().Типы());
			ТипОграничения = Новый ОписаниеТипов(ТипыВсехДокументов);
		КонецЕсли;

		Элементы.Ссылка.ОграничениеТипа = ТипОграничения;

		ЭтаФорма.Ссылка = ПараметрМВ.Ссылка;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
    
	СтрокаПредставления = "";
	ОкНаСервере(СтрокаПредставления);
	Закрыть(СтрокаПредставления);
    
КонецПроцедуры

&НаСервере
Процедура ОкНаСервере(СтрокаПредставления)
    
    Парам = Новый Массив(2);
    Парам[0] = ЭтаФорма.Ссылка.Дата;
    Парам[1] = ЭтаФорма.Ссылка;
	Момент = Новый (Тип("МоментВремени"),Парам);

	Если Параметры.ОтборПараметрЗапроса <> Неопределено Тогда
		
		пХранилище = ПолучитьИзВременногоХранилища(Параметры.ОбъектПутьКХранилищу);
		ТабПараметров = пХранилище.ТабПараметров;
		
		Строкапараметра = ТабПараметров.НайтиСтроки(Параметры.ОтборПараметрЗапроса)[0];
		
		Строкапараметра.Значение = Момент;
		СтрокаПредставления = Строка(Парам[0]) + ":" + Строка(Парам[1]);
		Возврат;

	КонецЕсли;
	
	СтрокаПредставления = Момент;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаПриИзменении(Элемент)
    
    Если ЗначениеЗаполнено(ЭтаФорма.Ссылка) Тогда
        М = Новый Массив(); 
        М.Добавить(ТипЗнч(ЭтаФорма.Ссылка));
    	Элемент.ОграничениеТипа = Новый ОписаниеТипов(М);
    Иначе    
    	Элемент.ОграничениеТипа = ПолучитьтипВсехДокументов();
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьтипВсехДокументов()

	Возврат Новый ОписаниеТипов(Документы.ТипВсеСсылки().Типы());

КонецФункции // ПолучитьтипВсехДокументов()
 
