Перем мПутьКФайлу;
Перем мПутьККаталогу;
Перем мРасширениеФайла;

Процедура КнопкаСохранитьMXLНажатие(Элемент)
	
	мРасширениеФайла = "mxl";
	СохранитьФайл();
	
КонецПроцедуры

Процедура КнопкаСохранитьЭксельНажатие(Элемент)
	
	мРасширениеФайла = "xls";
	СохранитьФайл();
	
КонецПроцедуры


Процедура СохранитьФайл()

	Длг = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	Длг.ПолноеИмяФайла = мПутьКФайлу;
	Длг.Каталог = мПутьККаталогу;
	Длг.Заголовок = "Файл для сохранения";
	Длг.Фильтр = "Файлы "+мРасширениеФайла+" (*."+мРасширениеФайла+")|*."+мРасширениеФайла+"|Все файлы (*.*)|*.*";
	Длг.Расширение = мРасширениеФайла;
	
	Если Не Длг.Выбрать() Тогда Возврат КонецЕсли;
	
	мПутьКФайлу = Длг.ПолноеИмяФайла;
	мПутьККаталогу = Длг.Каталог;
	
	Если мРасширениеФайла="mxl" Тогда
	    ТипФайла = ТипФайлаТабличногоДокумента.MXL;
	Иначе	
	    ТипФайла = ТипФайлаТабличногоДокумента.XLS;
	КонецЕсли; 
	
	ЭлементыФормы.ПолеТабличногоДокумента.Записать(мПутьКФайлу,ТипФайла);
	
	ЭлементыФормы.ПанельСообщение.Видимость = Истина;

КонецПроцедуры //СохранитьФайл
 

Процедура КнопкаОткрытьФайлНажатие(Элемент)
	
	Если мРасширениеФайла="mxl" Тогда
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Прочитать(мПутьКФайлу);
		ТабДок.Показать(мПутьКФайлу);
		
	Иначе
		ЗапуститьПриложение(мПутьКФайлу);
	КонецЕсли;	
	
КонецПроцедуры

Процедура КнопкаОткрытьПапкуНажатие(Элемент)
	
	ЗапуститьПриложение(мПутьККаталогу);
	
КонецПроцедуры

мПутьКФайлу = "";
мПутьККаталогу = "";
мРасширениеФайла = "mxl";
